  ### Deployment Results ✅

  **GrantBirki** successfully **noop** deployed branch `branch-deploy-v4.3.0` to **production**

  <details><summary>Show Results</summary>

  ```terraform
cloudflare_record.manager: Refreshing state... [id=2e208b66455795c12afd59021c56d891]
cloudflare_record.cache: Refreshing state... [id=03fe31c72264d5c29ed63ab520988055]
cloudflare_page_rule.fonts: Refreshing state... [id=ab4d1f4c56672ae225bdb63685501864]
cloudflare_record.dev_api: Refreshing state... [id=2cf1e8e4b922e8bce1ec023b64d04278]
cloudflare_page_rule.data_json: Refreshing state... [id=8965e35400084b17c7139d0edcfbdf01]
cloudflare_page_rule.status_custom_cache: Refreshing state... [id=9719ec8cc18c7947863c93bda58d409d]
cloudflare_page_rule.www_redirect: Refreshing state... [id=272eb1d91c4a29cc55466127803907c7]
cloudflare_record.market: Refreshing state... [id=c0e350a380953cdff74f16c911b3c595]
cloudflare_ruleset.cache_rules: Refreshing state... [id=6510b58fb0ac44c9984077e55eb158d0]
cloudflare_ruleset.security_response_headers: Refreshing state... [id=99896b7130154c279bd0dd1d94f109ec]
cloudflare_zone_settings_override.tarkov_dev: Refreshing state... [id=a17204c79af55fcf05e4975f66e2490e]
cloudflare_page_rule.cache_service: Refreshing state... [id=d3fc85e128cfc8b26eb4d22f2a3f7ea5]
cloudflare_zone.tarkov_dev: Refreshing state... [id=a17204c79af55fcf05e4975f66e2490e]
cloudflare_page_rule.images: Refreshing state... [id=72723f104b4316bd4e6c33203b606b4c]
cloudflare_page_rule.status_services: Refreshing state... [id=bf9bffb9e7a99924f271bff26fb871cf]
cloudflare_rate_limit.tarkov_dev: Refreshing state... [id=cbe28fcfa5ec4a6ab50abad705200d9d]
cloudflare_record.status: Refreshing state... [id=8b78ff4373eb3ed0fedc73ee511c4168]
cloudflare_record.www: Refreshing state... [id=c9b09dbb4885589e1d7a7ed17f0b7bc8]
cloudflare_argo.hideout_argo: Refreshing state... [id=b7e56bfdee62137c9d408f9f42472c8a]
cloudflare_page_rule.socket_service: Refreshing state... [id=c0ee007ef9d254825dba03239022572f]
cloudflare_record.socket: Refreshing state... [id=98b363905c2efdf7a730dc754d7a680f]
cloudflare_record.assets: Refreshing state... [id=fa9d45fc579f68883bce2b2e2bf4e378]
cloudflare_page_rule.manager_service: Refreshing state... [id=fe81e8e9c9fb30d44484cfcd600d2976]
cloudflare_record.api: Refreshing state... [id=5a6f0c44f89893d479067808915a429f]
cloudflare_record.root: Refreshing state... [id=58772b98e3e902db650041cbe2262633]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

# cloudflare_record.api has changed
~ resource "cloudflare_record" "api" {
      id              = "5a6f0c44f89893d479067808915a429f"
    ~ modified_on     = "2022-04-27T01:31:26.959011Z" -> "2023-01-30T17:08:19.058913Z"
      name            = "api"
    ~ proxied         = true -> false
    ~ value           = "api.hideout-api.workers.dev" -> "ecp.map.fastly.net"
      # (8 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }

# cloudflare_record.dev_api has been deleted
- resource "cloudflare_record" "dev_api" {
    - allow_overwrite = false -> null
    - created_on      = "2022-04-02T00:27:35.200502Z" -> null
    - hostname        = "dev-api.tarkov.dev" -> null
    - id              = "2cf1e8e4b922e8bce1ec023b64d04278" -> null
    - metadata        = {
        - "auto_added"             = "false"
        - "managed_by_apps"        = "false"
        - "managed_by_argo_tunnel" = "false"
        - "source"                 = "primary"
      } -> null
    - modified_on     = "2022-04-27T01:31:27.419468Z" -> null
    - name            = "dev-api" -> null
    - proxiable       = true -> null
    - proxied         = true -> null
    - ttl             = 1 -> null
    - type            = "CNAME" -> null
    - value           = "api-development.hideout-api.workers.dev" -> null
    - zone_id         = "a17204c79af55fcf05e4975f66e2490e" -> null
  }

# cloudflare_ruleset.security_response_headers has changed
~ resource "cloudflare_ruleset" "security_response_headers" {
    - description = "Sets security response headers" -> null
      id          = "99896b7130154c279bd0dd1d94f109ec"
      name        = "Security Response Headers"
      # (3 unchanged attributes hidden)

    ~ rules {
          id          = "9de3ffb4065e41e0bb86350735f26e77"
          # (4 unchanged attributes hidden)

        ~ action_parameters {
              # (24 unchanged attributes hidden)

            ~ headers {
                  name      = "Content-Security-Policy"
                ~ value     = "img-src 'self' https://assets.tarkov.dev https://avatars.githubusercontent.com data: https://images.weserv.nl; style-src 'self' https://tarkov.dev https://discord.com 'unsafe-inline'; font-src 'self' https://tarkov.dev https://discord.com; form-action 'self'; script-src 'self' *.cloudflareinsights.com wombatstats.com discord.com 'unsafe-inline'; object-src 'none'; base-uri 'self'" -> "img-src 'self' https://assets.tarkov.dev https://avatars.githubusercontent.com data: https://images.weserv.nl; style-src 'self' https://tarkov.dev https://discord.com 'unsafe-inline'; font-src 'self' https://tarkov.dev https://discord.com; form-action 'self'; script-src 'self' *.cloudflareinsights.com wombatstats.com discord.com js-agent.newrelic.com bam.nr-data.net bam-cell.nr-data.net 'unsafe-inline'; object-src 'none'; base-uri 'self'; "
                  # (1 unchanged attribute hidden)
              }
              # (2 unchanged blocks hidden)
          }
      }
  }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

# cloudflare_record.api will be updated in-place
~ resource "cloudflare_record" "api" {
      id              = "5a6f0c44f89893d479067808915a429f"
      name            = "api"
    ~ proxied         = false -> true
    ~ value           = "ecp.map.fastly.net" -> "api.hideout-api.workers.dev"
      # (9 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }

# cloudflare_record.dev_api will be created
+ resource "cloudflare_record" "dev_api" {
    + allow_overwrite = false
    + created_on      = (known after apply)
    + hostname        = (known after apply)
    + id              = (known after apply)
    + metadata        = (known after apply)
    + modified_on     = (known after apply)
    + name            = "dev-api"
    + proxiable       = (known after apply)
    + proxied         = true
    + ttl             = 1
    + type            = "CNAME"
    + value           = "api-development.hideout-api.workers.dev"
    + zone_id         = "a17204c79af55fcf05e4975f66e2490e"
  }

# cloudflare_ruleset.security_response_headers will be updated in-place
~ resource "cloudflare_ruleset" "security_response_headers" {
    + description = "Sets security response headers"
      id          = "99896b7130154c279bd0dd1d94f109ec"
      name        = "Security Response Headers"
      # (3 unchanged attributes hidden)

    ~ rules {
          id          = "9de3ffb4065e41e0bb86350735f26e77"
          # (4 unchanged attributes hidden)

        ~ action_parameters {
              # (24 unchanged attributes hidden)

            ~ headers {
                  name      = "Content-Security-Policy"
                ~ value     = "img-src 'self' https://assets.tarkov.dev https://avatars.githubusercontent.com data: https://images.weserv.nl; style-src 'self' https://tarkov.dev https://discord.com 'unsafe-inline'; font-src 'self' https://tarkov.dev https://discord.com; form-action 'self'; script-src 'self' *.cloudflareinsights.com wombatstats.com discord.com js-agent.newrelic.com bam.nr-data.net bam-cell.nr-data.net 'unsafe-inline'; object-src 'none'; base-uri 'self'; " -> "img-src 'self' https://assets.tarkov.dev https://avatars.githubusercontent.com data: https://images.weserv.nl; style-src 'self' https://tarkov.dev https://discord.com 'unsafe-inline'; font-src 'self' https://tarkov.dev https://discord.com; form-action 'self'; script-src 'self' *.cloudflareinsights.com wombatstats.com discord.com 'unsafe-inline'; object-src 'none'; base-uri 'self'"
                  # (1 unchanged attribute hidden)
              }
              # (2 unchanged blocks hidden)
          }
      }
  }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

  </details>